G21        ; Đơn vị: mm
G90        ; Tuyệt đối
G1 F1000   ; Feedrate

; Vị trí (X/Y/Z) và góc Euler (RX/RY/RZ - rad)

; ================================
; ĐI ĐƯỜNG THẲNG
; ================================

G1 X400 Y0 Z200 RX0.0 RY3.14 RZ0.0;
G1 X450 Y0 Z200 RX0.0 RY3.14 RZ0.0;
G1 X500 Y0 Z200 RX0.0 RY3.14 RZ0.0;   ; <-- Kết thúc đường thẳng

; ================================
; ĐƯỜNG TRÒN (bán kính ~50mm, tâm tại X=500, Y=0)
; ================================

G1 X500.0  Y-50.0  Z200 RX0.0 RY3.14 RZ0.0;
G1 X506.5  Y-48.3  Z200 RX0.0 RY3.14 RZ0.0;
G1 X512.9  Y-43.3  Z200 RX0.0 RY3.14 RZ0.0;
G1 X518.3  Y-35.3  Z200 RX0.0 RY3.14 RZ0.0;
G1 X522.6  Y-25.0  Z200 RX0.0 RY3.14 RZ0.0;
G1 X525.5  Y-12.9  Z200 RX0.0 RY3.14 RZ0.0;
G1 X526.9  Y0.0    Z200 RX0.0 RY3.14 RZ0.0;
G1 X525.5  Y12.9   Z200 RX0.0 RY3.14 RZ0.0;
G1 X522.6  Y25.0   Z200 RX0.0 RY3.14 RZ0.0;
G1 X518.3  Y35.3   Z200 RX0.0 RY3.14 RZ0.0;
G1 X512.9  Y43.3   Z200 RX0.0 RY3.14 RZ0.0;
G1 X506.5  Y48.3   Z200 RX0.0 RY3.14 RZ0.0;
G1 X500.0  Y50.0   Z200 RX0.0 RY3.14 RZ0.0;
G1 X493.5  Y48.3   Z200 RX0.0 RY3.14 RZ0.0;
G1 X487.1  Y43.3   Z200 RX0.0 RY3.14 RZ0.0;
G1 X481.7  Y35.3   Z200 RX0.0 RY3.14 RZ0.0;
G1 X477.4  Y25.0   Z200 RX0.0 RY3.14 RZ0.0;
G1 X474.5  Y12.9   Z200 RX0.0 RY3.14 RZ0.0;
G1 X473.1  Y0.0    Z200 RX0.0 RY3.14 RZ0.0;
G1 X500.0  Y-50.0  Z200 RX0.0  RY3.14 Z0.0;  
M30        ; End chương trình
